load-test/artillery.yml
config:
  target: "https://app.codemaster.io"
  phases:
    - duration: 60
      arrivalRate: 10
  scenarios:
    - flow:
        - get:
            url: "/api/courses"
        - post:
            url: "/api/auth/login"
            json:
              email: "test@example.com"
              password: "test123"